simulacoes/bump/rhoPimpleFoam/tranSonico/upwind/90x20/sim1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                              none;
    div(phi,U)                           Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U)))))  Gauss linear;
    div(phid,p)                          Gauss limitedLinear 1;
    div(phi,e)                           Gauss limitedLinear 1;
    div(phi,K)                           Gauss limitedLinear 1;
    div(phiv,p)                          Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
